package javaStudy;

public class Content {

	public static void main(String[] args) {
//		<자바란?>
//		1995년에 썬 마이크로시스템즈에서 발표한 객체지향 언어 (*현재는 오라클에 인수된 상태) 
//		c와 c++언어의 문법을 기본으로 차용해서 개발된 언어. (포인터와 다중 상속 부분을 없앰) 
//
//		>플랫폼에 독립적이다. 
//		- 자바로 만들어진 프로그램은 JVM만 있으면 윈도우, 리눅스, 맥 등 어떤 플랫폼에서도 실행이 가능하다.
//		   (JVM:자바로 만들어진 프로그램을 실행해주는 프로그램)
//
//		>자바는 객체지향 언어이다. 
//		- 대표적 장점은 재활용성과 직관성이 강하다는 점이다. 
//
//		>메모리 관리를 자동으로 해준다.
//		- c나 c++과는 다르게 어려운 메모리 관리에 대한 부분을 자동으로 처리해준다는 장점이 있다.
//		- Garbage Collector가 자동으로 메모리를 정리해준다. 
		
		
//		<자바 개발 환경 구축>
//		자바로 개발을 하기위해선 JDK를 설치해야 한다.
//		JDK는 "Java Development Kit"으로 "자바 개발자 도구"의 약자이다.
//
//		오라클 사이트에서 다운받는다.
		
		
//		<자바 개발 순서>
//		코드 작성 -> 코드 컴파일 -> JVM으로 실행

//		1.소스 작성
//		2.작성한 소스 컴파일
//		3.컴파일한 소스를 JVM을 이용하여 실행
		
		
//		<주석문>
//		주석이란, 프로그램의 코드와 실행에 영향을 주지 않는 문장이다.
//		(주석은 컴파일 대상에서 제외된다.)
//
//		>주석의 종류
//		- 구현 주석
//		  - 행단위 주석 (// 를 해주면, 해당 행이 주석 처리됨 )
//		  - 블럭단위 주석 (/* 주석으로 사용할 내용 */ )
//
//		- 문서화 주석
//		  - /** 문서에 포함할 내용을 작성함 */
//		  - 문서화 주석은 클래스, 인터페이스 그리고 멤버 당 하나씩 가질 수 있고, 선언 바로 전에 작성
//		  - 문서화 주석 예
		
//		<행 단위 주석>
		// code
		// code
		// code
		
//		<블럭단위 주석>
		/* code
		code
		code */
		
//		<문서화 주석>
		/**
		 * code
		 */
		
		
	} // end of main

} // end of class
